pages/Opinion/personal_websites_are_dumb/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Personal Websties Are Dumb</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
  <header>
   <h1> <a href="../../../">Ian Stranathan </a></h1>
    <p> Noodling around: Graphics | Game Development | Physics | Math <p>
    <nav>
      <ul>
	<li><a href="../../Misc/about/"><i class="fa-regular fa-address-card"></i></a></li>
	<li><a href="mailto:ian@wabisoft.io"><i class="fa fa-envelope" aria-hidden="true"></i></a></li>
	<li><a href="https://github.com/stranathan"><i class="fa-brands fa-github"></i></a></li>
      </ul>
    </nav>
  </header><div id="content">
<p>
This is <a href="http://number-none.com/blow/blog/">Jonathan Blow's Website</a>; need I say more? (Extended commentary can be found <a href="https://motherfuckingwebsite.com/">here</a>)
</p>

<p>
<a href="https://www.youtube.com/watch?v=tHEOGrkhDp0">Advertizing is almost always bad</a> (At a minimum it's unsubstantive/ empty.)
And, most of the time, especially with younger people (or people who do not have a well developed career), personal websites are just personal advertising. 
</p>


<p>
Jon Blow is a proven, world-class programmer and designer, but we all can't be Jon Blow.
</p>

<p>
Enter the personal portfolio (a website being part of that).
</p>

<p>
In line with skill and credentialing inflation, a well developed (I should say superficially pleasing) portfolio is (counterproductively) required for a job nowadays.
(But wait, wasn't that what college was for? Why did I study so hard and stress out so much if that doesn't count as a general vetting process of baseline competence?
— Gute Frage nächste Frage.)
</p>

<p>
It's a strange, boring dystopia/ kafka-esque moment when you're being interviewed for a technical skill by someone who doesn't have said technical skill and
they're judging you primarily and negatively for the plainness of your portfolio website.
(This is disappointing for both parties, while Jon Blow is anecdotal, I do geuinely think website excessiveness is in fact usually inversly related with ability
(with some notable exceptions like <a href="http://acko.net">Steven Witten</a>), I assume they want the best engineer possible and I want to waste as little time as possible)
</p>

<p>
I could try to make a fanicer website (<a href="https://zackmibrown.github.io/">here's one</a> I made for a friend) but it's ultimately disaptive for non-renewable resources like time and
attention which we're all rapidly running out of.
</p>

<p>
Wouldn't we all rather be writing stories, making games or solving interesting &amp; real problems instead?
</p>

<p>
Moreover, isn't it, as said above, counterproductive to a real portfolio to spend said resources on something that ultimately has nothing to do with the skills and
knowledge you're trying to hone?
</p>

<p>
Historically, I've tended to remake my website about once a year (revist resume, tidy up etc)
and this year is no different. (Emacs has become my main text editor and so another
website iteration using org mode seemed prudent), but I'm done doing anything beyond content (anything superfluous that I don't find interesting or care about).
</p>

<p>
Just minimal styling and a barebones static site from here on out.
(I still want slightly more control and customizable workflow than an SSG framework allows otherwise I'd just do that. Also, they can also be
complicated to maintain, usually have a lot of dependencies and break over time)
</p>

<p>
Maintenance is a contraint with a concomitant cost and I'm just not willing to pay it for something as insignificant as a personal website.
</p>

<p>
If there's a silver lining, maybe this is lesson that's transferable to other things that have incurred a heavy maintenance cost, accepting and hacking ontop of rather
than reinventing the various technical black boxes<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> that may come.
</p>

<p>
Maybe this is finally <b>how I learn to stop worrying and love not reinventing the wheel.</b>
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><blockquote>
<p>
The Black Box Abstraction is key to all of science, engineering, computing, and in fact to civilization itself.
A result once established can be used without knowing how the result was achieved.
Once a black box has been verified, I can rely on that black box to satisfy its specification.
Analogy: in mathematics, we can rely on an accepted theorem without proving the theorem all over again. &#x2013; <a href="https://www.quora.com/profile/Jamie-Lawson-5">Jamie Lawson</a>
</p>
</blockquote></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
</div>
</main>
  <footer>
      <p>©Ian Stranathan 2022</p> 
  <footer>
</body>